cases/subsonic/Lambert/J20_Ligament/setup/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
//
//  Lambert (2019) LJICF rectangular test section
//  -----------------------------------------------
//  Ref: Lambert et al., ILASS-Europe 2019, "Enhancement of the
//       Madabhushi LJICF Breakup Model by a Ligament Breakup Mechanism"
//
//  Domain:
//    x: [0, 0.06858]  length  (l/d ~ 150)
//    y: [0, 0.04318]  height  (quadratic cross-section, w/d ~ 95)
//    z: [-0.02159, +0.02159]  spanwise (w/d ~ 95)
//
//  Injector:
//    d = 457 µm = 4.57e-4 m
//    Position: x = 0.02 m from inlet, y = 0 (bottom wall), z = 0 (centreline)
//
//  Conditions:
//    T = 300 K, p = 506625 Pa (~5 atm)
//    Gas (air): rho ~ 5.88 kg/m³, mu ~ 1.85e-5 Pa·s
//    We = 1500, J = 10 or 20
//    u_gas ~ 120 m/s
//
//  Boundary layer:
//    y+ ~ 1 → first cell height ~ 1.2 µm at both walls
//    Wall-normal 3-section multi-grading: BL(30) + bulk(50) + BL(30) = 110 cells
//    Bottom: expansion 300, Top: expansion 1/300 (symmetric)
//
//  Mesh zones (x-direction):
//    B1: [0, 0.0125]     upstream of jet, mild compression towards jet
//    B2: [0.0125, 0.0275] jet zone (centred on x_inj = 0.02), fine
//    B3: [0.0275, 0.06858] downstream, mild expansion
//
//  Mesh zones (z-direction):
//    B1: [-0.02159, -0.0075]  outer, coarser
//    B2: [-0.0075, +0.0075]   jet zone, fine
//    B3: [+0.0075, +0.02159]  outer, coarser
//
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

// --- X coordinates (streamwise) ---
x0   0.0;
x1   0.0125;     // upstream block end
x2   0.0275;     // jet zone end  (jet at x=0.02, ±7.5mm)
x3   0.06858;    // outlet

// --- Y coordinates (wall-normal) ---
y0   0.0;        // bottom wall (injector location)
y1   0.04318;    // top

// --- Z coordinates (spanwise) ---
z0  -0.02159;
z1  -0.0075;
z2   0.0075;
z3   0.02159;

vertices
(
    // --- y = y0  plane (bottom wall, z = z0..z3) ---
    // Row z0:  x0..x3
    ( $x0  $y0  $z0 )   // 0
    ( $x1  $y0  $z0 )   // 1
    ( $x2  $y0  $z0 )   // 2
    ( $x3  $y0  $z0 )   // 3

    // Row z1:
    ( $x0  $y0  $z1 )   // 4
    ( $x1  $y0  $z1 )   // 5
    ( $x2  $y0  $z1 )   // 6
    ( $x3  $y0  $z1 )   // 7

    // Row z2:
    ( $x0  $y0  $z2 )   // 8
    ( $x1  $y0  $z2 )   // 9
    ( $x2  $y0  $z2 )   // 10
    ( $x3  $y0  $z2 )   // 11

    // Row z3:
    ( $x0  $y0  $z3 )   // 12
    ( $x1  $y0  $z3 )   // 13
    ( $x2  $y0  $z3 )   // 14
    ( $x3  $y0  $z3 )   // 15

    // --- y = y1  plane (top wall, z = z0..z3) ---
    // Row z0:
    ( $x0  $y1  $z0 )   // 16
    ( $x1  $y1  $z0 )   // 17
    ( $x2  $y1  $z0 )   // 18
    ( $x3  $y1  $z0 )   // 19

    // Row z1:
    ( $x0  $y1  $z1 )   // 20
    ( $x1  $y1  $z1 )   // 21
    ( $x2  $y1  $z1 )   // 22
    ( $x3  $y1  $z1 )   // 23

    // Row z2:
    ( $x0  $y1  $z2 )   // 24
    ( $x1  $y1  $z2 )   // 25
    ( $x2  $y1  $z2 )   // 26
    ( $x3  $y1  $z2 )   // 27

    // Row z3:
    ( $x0  $y1  $z3 )   // 28
    ( $x1  $y1  $z3 )   // 29
    ( $x2  $y1  $z3 )   // 30
    ( $x3  $y1  $z3 )   // 31
);

blocks
(
    // ================================================================
    //  9 blocks: 3 (x) × 1 (y) × 3 (z)
    //
    //  Y-grading: symmetric BL at both walls
    //    Section 1:  4.6% of height, 30 cells, expansion 300    → bottom BL, h1 ~ 1.2 µm
    //    Section 2: 90.8% of height, 50 cells, expansion 1.0    → bulk (uniform)
    //    Section 3:  4.6% of height, 30 cells, expansion 1/300  → top BL, h1 ~ 1.2 µm
    //
    //  X-grading:
    //    B1 (upstream):   compression towards x1 → expansion ratio 0.4
    //    B2 (jet zone):   uniform
    //    B3 (downstream): expansion away from x2 → expansion ratio 3.0
    //
    //  Z-grading:
    //    B1 (z0→z1): compression towards z1 → expansion ratio 0.4
    //    B2 (z1→z2): uniform
    //    B3 (z2→z3): expansion away from z2 → expansion ratio 2.5
    // ================================================================

    // Block naming convention: bX_Z  (x-block _ z-block)

    // --- z-block 1: z0 → z1 ---
    // b1_1: upstream, outer-z
    hex ( 0  1  17 16   4  5  21 20 )
    ( 25 110 20 )
    simpleGrading
    (
        0.4                                         // x: compress towards jet
        ((0.046 30 300)(0.908 50 1.0)(0.046 30 0.00333))              // y: BL grading
        0.4                                         // z: compress towards centre
    )

    // b2_1: jet zone, outer-z
    hex ( 1  2  18 17   5  6  22 21 )
    ( 60 110 20 )
    simpleGrading
    (
        1                                           // x: uniform
        ((0.046 30 300)(0.908 50 1.0)(0.046 30 0.00333))              // y: BL grading
        0.4                                         // z: compress towards centre
    )

    // b3_1: downstream, outer-z
    hex ( 2  3  19 18   6  7  23 22 )
    ( 60 110 20 )
    simpleGrading
    (
        3.0                                         // x: expand downstream
        ((0.046 30 300)(0.908 50 1.0)(0.046 30 0.00333))              // y: BL grading
        0.4                                         // z: compress towards centre
    )

    // --- z-block 2: z1 → z2 (jet zone in z) ---
    // b1_2: upstream, centre-z
    hex ( 4  5  21 20   8  9  25 24 )
    ( 25 110 60 )
    simpleGrading
    (
        0.4                                         // x
        ((0.046 30 300)(0.908 50 1.0)(0.046 30 0.00333))              // y
        1                                           // z: uniform
    )

    // b2_2: jet zone centre — FINEST BLOCK
    hex ( 5  6  22 21   9  10 26 25 )
    ( 60 110 60 )
    simpleGrading
    (
        1                                           // x: uniform
        ((0.046 30 300)(0.908 50 1.0)(0.046 30 0.00333))              // y
        1                                           // z: uniform
    )

    // b3_2: downstream, centre-z
    hex ( 6  7  23 22   10 11 27 26 )
    ( 60 110 60 )
    simpleGrading
    (
        3.0                                         // x
        ((0.046 30 300)(0.908 50 1.0)(0.046 30 0.00333))              // y
        1                                           // z: uniform
    )

    // --- z-block 3: z2 → z3 ---
    // b1_3: upstream, outer-z
    hex ( 8  9  25 24   12 13 29 28 )
    ( 25 110 20 )
    simpleGrading
    (
        0.4                                         // x
        ((0.046 30 300)(0.908 50 1.0)(0.046 30 0.00333))              // y
        2.5                                         // z: expand outward
    )

    // b2_3: jet zone, outer-z
    hex ( 9  10 26 25   13 14 30 29 )
    ( 60 110 20 )
    simpleGrading
    (
        1                                           // x
        ((0.046 30 300)(0.908 50 1.0)(0.046 30 0.00333))              // y
        2.5                                         // z: expand outward
    )

    // b3_3: downstream, outer-z
    hex ( 10 11 27 26   14 15 31 30 )
    ( 60 110 20 )
    simpleGrading
    (
        3.0                                         // x
        ((0.046 30 300)(0.908 50 1.0)(0.046 30 0.00333))              // y
        2.5                                         // z: expand outward
    )
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            // x = x0 face, all z-blocks
            ( 0   16  20  4  )
            ( 4   20  24  8  )
            ( 8   24  28  12 )
        );
    }

    wallTop
    {
        type wall;
        faces
        (
            // y = y1 face (top wall), all blocks
            ( 16 17 21 20 )
            ( 17 18 22 21 )
            ( 18 19 23 22 )
            ( 20 21 25 24 )
            ( 21 22 26 25 )
            ( 22 23 27 26 )
            ( 24 25 29 28 )
            ( 25 26 30 29 )
            ( 26 27 31 30 )
        );
    }

    outletRight
    {
        type patch;
        faces
        (
            // x = x3 face (downstream outlet)
            ( 3   7  23  19 )
            ( 7  11  27  23 )
            ( 11 15  31  27 )
        );
    }

    wallBottom
    {
        type wall;
        faces
        (
            // y = y0 face (bottom wall — injector wall)
            ( 0   1   5   4  )
            ( 1   2   6   5  )
            ( 2   3   7   6  )
            ( 4   5   9   8  )
            ( 5   6  10   9  )
            ( 6   7  11  10  )
            ( 8   9  13  12  )
            ( 9  10  14  13  )
            ( 10 11  15  14  )
        );
    }

    front
    {
        type symmetry;
        faces
        (
            // z = z3 face
            ( 12 13 29 28 )
            ( 13 14 30 29 )
            ( 14 15 31 30 )
        );
    }

    back
    {
        type symmetry;
        faces
        (
            // z = z0 face
            ( 0   1  17  16 )
            ( 1   2  18  17 )
            ( 2   3  19  18 )
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
