cases/subsonic/Lambert/J20_Ligament/setup/constant/radiationProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      radiationProperties;
}

radiation       off;
radiationModel  none;

// ************************************************************************* //
