cases/subsonic/Lambert/J20_Ligament/setup/constant/smoothingProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      smoothingProperties;
}

smoothBandwidth   0.000458;   // 1 × Dinj = 1 × 1.6mm — punto di partenza
